

export const splitWordsBySeparator = (words, separator) => {
    // Ваше решение
    let newarray = [];
    

};


// Необходимо написать функцию, которая разделит каждую строку в массиве words по строке separator. Необходимо вернуть массив получившихся после разделения строк, исключая пустые строки.

// Формат ввода
// Вы должны экспортировать функцию splitWordsBySeparator, которая принимает на вход два аргумента:

// words — массив строк, которые нужно разбить. Длина массива не превышает 
// 3
// ⋅
// 1
// 0
// 5
// 3⋅10 
// 5
//   элементов. Длина каждой строки в массиве не превышает 
// 1
// 0
// 7
// 10 
// 7
//   символов.
// separator — строка-разделитель, может иметь произвольную длину.
// Формат вывода
// Функция должна возвращать массив строк, который является результатом выполнения «разделения». Он не должен содержать пустых строк.